BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_UART_PDL_v1_0/API/SCB_UART_PDL.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`.h
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
*  This file provides constants and parameter values for the UART component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(`$INSTANCE_NAME`_CY_SCB_UART_PDL_H)
#define `$INSTANCE_NAME`_CY_SCB_UART_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define `$INSTANCE_NAME`_DIRECTION  (`$Direction`U)
#define `$INSTANCE_NAME`_ENABLE_RTS (`$EnableRts`U)
#define `$INSTANCE_NAME`_ENABLE_CTS (`$EnableCts`U)

/* UART direction enum */
#define `$INSTANCE_NAME`_RX    (0x1U)
#define `$INSTANCE_NAME`_TX    (0x2U)

#define `$INSTANCE_NAME`_ENABLE_RX  (0UL != (`$INSTANCE_NAME`_DIRECTION & `$INSTANCE_NAME`_RX))
#define `$INSTANCE_NAME`_ENABLE_TX  (0UL != (`$INSTANCE_NAME`_DIRECTION & `$INSTANCE_NAME`_TX))


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component specific functions. */
void `$INSTANCE_NAME`_Start(void);

/* Basic functions */
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Init(cy_stc_scb_uart_config_t const *config);
__STATIC_INLINE void `$INSTANCE_NAME`_DeInit(void);
__STATIC_INLINE void `$INSTANCE_NAME`_Enable(void);
__STATIC_INLINE void `$INSTANCE_NAME`_Disable(void);

/* Register callback. */
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterCallback(scb_uart_handle_events_t callback);

/* Configuration change. */
#if (`$INSTANCE_NAME`_ENABLE_CTS)
__STATIC_INLINE void `$INSTANCE_NAME`_EnableCts(void);
__STATIC_INLINE void `$INSTANCE_NAME`_DisableCts(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_CTS) */

#if (`$INSTANCE_NAME`_ENABLE_RTS)
__STATIC_INLINE void     `$INSTANCE_NAME`_SetRtsFifoLevel(uint32_t rxFifoLevel);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetRtsFifoLevel(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_RTS) */

__STATIC_INLINE void `$INSTANCE_NAME`_EnableSkipStart(void);
__STATIC_INLINE void `$INSTANCE_NAME`_DisableSkipStart(void);

#if (`$INSTANCE_NAME`_ENABLE_RX)
/* Low level: Receive direction. */
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_Get(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetArray(void *rxBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_GetArrayBlocking(void *rxBuf, uint32_t size);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetRxFifoStatus(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_ClearRxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInRxFifo(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_ClearRxFifo(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_RX) */

#if (`$INSTANCE_NAME`_ENABLE_TX)
/* Low level: Transmit direction. */
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_Put(uint32_t data);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_PutArray(void *txBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_PutArrayBlocking(void *txBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_PutString(char string[]);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetTxFifoStatus(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_ClearTxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInTxFifo(void);
__STATIC_INLINE bool     `$INSTANCE_NAME`_IsTxComplete(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_ClearTxFifo(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_TX) */

#if (`$INSTANCE_NAME`_ENABLE_RX)
/* High level: Ring buffer functions. */
__STATIC_INLINE void     `$INSTANCE_NAME`_StartRingBuffer(void *ringBuffer, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_StopRingBuffer(void);
__STATIC_INLINE void     `$INSTANCE_NAME`_ClearRingBuffer(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInRingBuffer(void);

/* High level: Receive direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Receive(void *rxBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_AbortReceive(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetReceiveStatus(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumReceived(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_RX) */

#if (`$INSTANCE_NAME`_ENABLE_TX)
/* High level: Transmit direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Transmit(void *txBuf, uint32_t size);
__STATIC_INLINE void     `$INSTANCE_NAME`_AbortTransmit(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetTransmitStatus(void);
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumLeftToTransmit(void);
#endif /* (`$INSTANCE_NAME`_ENABLE_TX) */

/* Interrupt handler */
__STATIC_INLINE void `$INSTANCE_NAME`_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8 `$INSTANCE_NAME`_initVar;
extern cy_stc_scb_uart_config_t `=$CY_CONST_CONFIG ? "const " : ""``$INSTANCE_NAME`_config;
extern cy_stc_scb_uart_context_t `$INSTANCE_NAME`_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the hardware */
#define `$INSTANCE_NAME`_HW     ((CySCB_Type *) `$INSTANCE_NAME`_SCB__HW)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

