BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_UART_PDL_v1_0/API/SCB_UART_PDL.h
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Init(cy_stc_scb_uart_config_t const *config)
{
   return Cy_SCB_UART_Init(`$INSTANCE_NAME`_HW, config, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_DeInit(void)
{
    Cy_SCB_UART_DeInit(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Enable(void)
{
    Cy_SCB_UART_Enable(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Disable(void)
{
    Cy_SCB_UART_Disable(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_RegisterCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_RegisterCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_RegisterCallback(scb_uart_handle_events_t callback)
{
    Cy_SCB_UART_RegisterCallback(`$INSTANCE_NAME`_HW, callback, &`$INSTANCE_NAME`_context);
}


#if (`$INSTANCE_NAME`_ENABLE_CTS)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_EnableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_EnableCts(void)
{
    Cy_SCB_UART_EnableCts(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableCts() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_DisableCts(void)
{
    Cy_SCB_UART_DisableCts(`$INSTANCE_NAME`_HW);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_CTS) */


#if (`$INSTANCE_NAME`_ENABLE_RTS)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_SetRtsFifoLevel(uint32_t rxFifoLevel)
{
    Cy_SCB_UART_SetRtsFifoLevel(`$INSTANCE_NAME`_HW, rxFifoLevel);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRtsFifoLevel() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetRtsFifoLevel(void)
{
    return Cy_SCB_UART_GetRtsFifoLevel(`$INSTANCE_NAME`_HW);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_RTS) */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_EnableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_EnableSkipStart(void)
{
    Cy_SCB_UART_EnableSkipStart(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_DisableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableSkipStart() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_DisableSkipStart(void)
{
    Cy_SCB_UART_DisableSkipStart(`$INSTANCE_NAME`_HW);
}


#if (`$INSTANCE_NAME`_ENABLE_RX)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Get
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Get() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_Get(void)
{
    return Cy_SCB_UART_Get(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetArray(void *rxBuf, uint32_t size)
{
    return Cy_SCB_UART_GetArray(`$INSTANCE_NAME`_HW, rxBuf, size);
}


