BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_UART_PDL_v1_0/API/SCB_UART_PDL.h
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_GetArrayBlocking(void *rxBuf, uint32_t size)
{
    Cy_SCB_UART_GetArrayBlocking(`$INSTANCE_NAME`_HW, rxBuf, size);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetRxFifoStatus(void)
{
    return Cy_SCB_UART_GetRxFifoStatus(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ClearRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_ClearRxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearRxFifoStatus(`$INSTANCE_NAME`_HW, clearMask);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetNumInRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInRxFifo(void)
{
    return Cy_SCB_UART_GetNumInRxFifo(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ClearRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_ClearRxFifo(void)
{
    Cy_SCB_UART_ClearRxFifo(`$INSTANCE_NAME`_HW);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_RX) */


#if (`$INSTANCE_NAME`_ENABLE_TX)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Put
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Put() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_Put(uint32_t data)
{
    return Cy_SCB_UART_Put(`$INSTANCE_NAME`_HW,data);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_PutArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArray() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_PutArray(void *txBuf, uint32_t size)
{
    return Cy_SCB_UART_PutArray(`$INSTANCE_NAME`_HW, txBuf, size);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_PutArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArrayBlocking() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_PutArrayBlocking(void *txBuf, uint32_t size)
{
    Cy_SCB_UART_PutArrayBlocking(`$INSTANCE_NAME`_HW, txBuf, size);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_PutString
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutString() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_PutString(char string[])
{
    Cy_SCB_UART_PutString(`$INSTANCE_NAME`_HW, string);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetTxFifoStatus(void)
{
    return Cy_SCB_UART_GetTxFifoStatus(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ClearTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifoStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_ClearTxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearTxFifoStatus(`$INSTANCE_NAME`_HW, clearMask);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetNumInTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInTxFifo(void)
{
    return Cy_SCB_UART_GetNumInTxFifo(`$INSTANCE_NAME`_HW);
}


