BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_UART_PDL_v1_0/API/SCB_UART_PDL.h
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_IsTxComplete
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_IsTxComplete() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool `$INSTANCE_NAME`_IsTxComplete(void)
{
    return Cy_SCB_UART_IsTxComplete(`$INSTANCE_NAME`_HW);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ClearTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifo() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_ClearTxFifo(void)
{
    Cy_SCB_UART_ClearTxFifo(`$INSTANCE_NAME`_HW);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_TX) */


#if (`$INSTANCE_NAME`_ENABLE_RX)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_StartRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StartRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_StartRingBuffer(void *ringBuffer, uint32_t size)
{
    Cy_SCB_UART_StartRingBuffer(`$INSTANCE_NAME`_HW, ringBuffer, size, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_StopRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StopRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_StopRingBuffer(void)
{
    Cy_SCB_UART_StopRingBuffer(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ClearRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_ClearRingBuffer(void)
{
    Cy_SCB_UART_ClearRingBuffer(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetNumInRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRingBuffer() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumInRingBuffer(void)
{
    return Cy_SCB_UART_GetNumInRingBuffer(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Receive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Receive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Receive(void *rxBuf, uint32_t size)
{
    return Cy_SCB_UART_Receive(`$INSTANCE_NAME`_HW, rxBuf, size, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetReceiveStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetReceiveStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetReceiveStatus(void)
{
    return Cy_SCB_UART_GetReceiveStatus(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_AbortReceive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortReceive() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_AbortReceive(void)
{
    Cy_SCB_UART_AbortReceive(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetNumReceived
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumReceived() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumReceived(void)
{
    return Cy_SCB_UART_GetNumReceived(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_RX) */


#if (`$INSTANCE_NAME`_ENABLE_TX)
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Transmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Transmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t `$INSTANCE_NAME`_Transmit(void *txBuf, uint32_t size)
{
    return Cy_SCB_UART_Transmit(`$INSTANCE_NAME`_HW, txBuf, size, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetTransmitStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTransmitStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetTransmitStatus(void)
{
    return Cy_SCB_UART_GetTransmitStatus(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


