BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/SCB_UART_PDL_v1_0/API/SCB_UART_PDL.h
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_AbortTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_AbortTransmit(void)
{
    Cy_SCB_UART_AbortTransmit(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_GetNumLeftToTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumLeftToTransmit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t `$INSTANCE_NAME`_GetNumLeftToTransmit(void)
{
    return Cy_SCB_UART_GetNumLeftToTransmit(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}
#endif /* (`$INSTANCE_NAME`_ENABLE_TX) */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Interrupt() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_Interrupt(void)
{
    Cy_SCB_UART_Interrupt(`$INSTANCE_NAME`_HW, &`$INSTANCE_NAME`_context);
}

#if defined(__cplusplus)
}
#endif

#endif /* `$INSTANCE_NAME`_CY_SCB_UART_PDL_H */


/* [] END OF FILE */
